---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CurrencyPerSquareFoot
source: html/9eae205b-6df9-b3df-8bd0-ad376555e97d.htm
---
# Autodesk.Revit.DB.UnitTypeId.CurrencyPerSquareFoot Property

Cost per square foot.

## Syntax (C#)
```csharp
public static ForgeTypeId CurrencyPerSquareFoot { get; }
```